freesbeeGE/test/dati/g/test26.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ge="http://ge.freesbee.unibas.it/">
    <soap:Header/>
    <soap:Body>
        <ge:consegnaMessaggio>
            <messaggioSoap>
                <confermaPubblicatori>
                    <pubblicatore>
                        <nomePubblicatore>B</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <pubblicatore>
                        <nomePubblicatore>C</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <nomeSottoscrittore>L</nomeSottoscrittore>
                    <tipoSottoscrittore>SPC</tipoSottoscrittore>
                    <categoriaSottoscrizione>Test10</categoriaSottoscrizione>
                </confermaPubblicatori>
            </messaggioSoap>
            <nomePubblicatore>GE</nomePubblicatore>
            <tipoPubblicatore>SPC</tipoPubblicatore>
            <categoriaEventi>GEControlProtocol</categoriaEventi>
        </ge:consegnaMessaggio>
    </soap:Body>
</soap:Envelope>